#include <stdio.h>
#include <math.h>

int main() {
    int x, y, z;
    double a;

    // Введення вхідних даних
    printf("Введіть значення x: ");
    scanf("%d", &x);

    printf("Введіть значення y: ");
    scanf("%d", &y);

    printf("Введіть значення z: ");
    scanf("%d", &z);

    // Перевірка на коректність обчислення (щоб не було коренів з від'ємних чисел та ділення на нуль)
    if (x < 0 || y < 0 || z < 0) {
        printf("Помилка: не можна знаходити корінь із від’ємного числа.\n");
    } else if (sqrt(y) - 2 * sqrt(x * z) == 0) {
        printf("Помилка: ділення на нуль неможливе.\n");
    } else {
        // Обчислення значення функції
        a = (sqrt(x) + 2 * sqrt(y * z)) / (sqrt(y) - 2 * sqrt(x * z));

        // Виведення результату
        printf("Значення функції a: %.4lf\n", a);
    }

    return 0;
}
